app/controllers/mugshots_controller.rb

INSERT INTO `mugshots` (`size`, `created_at`, `content_type`, `thumbnail`, `updated_at`, `parent_id`, `filename`, `height`, `width`) VALUES(41911, '2010-03-23 12:51:16', 'image/jpeg', NULL, '2010-03-23 12:51:16', NULL, 'Betty-Rubble.jpg', 200, 87)
---
	def create
	 # protect_from_forgery :only => [:create, :update, :destroy]
	  @mugshot = Mugshot.new(params[:mugshot])
	  if @mugshot.save

SELECT * FROM `mugshots` WHERE (`mugshots`.`id` = 1)
---
  def show
    @mugshot=Mugshot.find(params[:id])