app/controllers/photo_admins_controller.rb

SELECT * FROM `photo_admins`
---
  def index
    @photo_admins = PhotoAdmin.all